

&НаСервереБезКонтекста
Процедура РасшСН_ЗаполнитьВходящиеЦеныВместоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура РасшСН_ЗаполнитьВходящиеЦеныВместо(Команда)
	РасшСН_ЗаполнитьВходящиеЦеныВместоНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура РасшСН_ЗаполнитьВсеИПересчитатьПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура РасшСН_ЗаполнитьВсеИПересчитатьПосле(Команда)
	РасшСН_ЗаполнитьВсеИПересчитатьПослеНаСервере();
КонецПроцедуры

